# Parameter Type Id Rebar Shape Crank End Angled Length Property

Source: https://www.revitapidocs.com/2026/c0a46b7e-faec-5ac8-e50a-ce2f057eb9c9.htm

---

| Parameter Type Id Rebar Shape Crank End Angled Length Property |
| --- |

"End Crank Angled Length"
**Namespace:** Autodesk.Revit.DB
**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26\.0\.4\.0 (26\.0\.4\.0\) Syntax C\# VB C\+\+ F\#
```
public static ForgeTypeId RebarShapeCrankEndAngledLength { get; }
```

```
Public Shared ReadOnly Property RebarShapeCrankEndAngledLength As ForgeTypeId
	Get
```

```
public:
static property ForgeTypeId^ RebarShapeCrankEndAngledLength {
	ForgeTypeId^ get ();
}
```

```
static member RebarShapeCrankEndAngledLength : ForgeTypeId with get
```

#### Property Value

ForgeTypeId See Also

#### Reference

ParameterTypeId Class Autodesk.Revit.DB Namespace